*** src/io/reader/record.rs:13:5: replace read_record -> io::Result<usize> with Ok(0)

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_record -> io::Result<usize> with Ok(0)
@@ -5,55 +5,17 @@
 
 use super::read_line;
 use crate::Record;
 
 pub(crate) fn read_record<R>(reader: &mut R, record: &mut Record) -> io::Result<usize>
 where
     R: BufRead,
 {
-    let fields = record.fields_mut();
-
-    let buf = &mut fields.buf;
-    buf.clear();
-
-    let bounds = &mut fields.bounds;
-
-    let mut len = 0;
-
-    len += read_required_field(reader, buf)?;
-    bounds.reference_sequence_name_end = buf.len();
-
-    len += read_required_field(reader, buf)?;
-    bounds.variant_start_end = buf.len();
-
-    len += read_required_field(reader, buf)?;
-    bounds.ids_end = buf.len();
-
-    len += read_required_field(reader, buf)?;
-    bounds.reference_bases_end = buf.len();
-
-    len += read_required_field(reader, buf)?;
-    bounds.alternate_bases_end = buf.len();
-
-    len += read_required_field(reader, buf)?;
-    bounds.quality_score_end = buf.len();
-
-    len += read_required_field(reader, buf)?;
-    bounds.filters_end = buf.len();
-
-    let (n, is_eol) = read_last_required_field(reader, buf)?;
-    len += n;
-    bounds.info_end = buf.len();
-
-    if !is_eol {
-        len += read_line(reader, buf)?;
-    }
-
-    Ok(len)
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<usize>
 where
     R: BufRead,
 {
     let (len, is_eol) = read_field(reader, dst)?;

---- corpus_oracle stdout ----

thread 'corpus_oracle' (251350) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 5 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=true/records=0/samples=3/err=
  kept_18376ff284f05ea4.vcf: accepted=true/records=25/samples=2/err= → accepted=true/records=0/samples=2/err=
  kept_2938d09cda0669b5.vcf: accepted=true/records=13/samples=2/err= → accepted=true/records=0/samples=2/err=
  kept_352e67b165bcecba.vcf: accepted=true/records=16/samples=1/err= → accepted=true/records=0/samples=1/err=
  kept_59c0607bd55858c7.vcf: accepted=true/records=16/samples=3/err= → accepted=true/records=0/samples=3/err=

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.76s

*** result: Failure(101)
