*** src/io/reader/record_buf/samples/values/value.rs:34:9: replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None

*** mutation diff:
--- src/io/reader/record_buf/samples/values/value.rs
+++ replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None
@@ -26,23 +26,17 @@
     /// The string value is invalid.
     InvalidString(str::Utf8Error),
     /// The genotype value is invalid.
     InvalidGenotype(genotype::ParseError),
 }
 
 impl error::Error for ParseError {
     fn source(&self) -> Option<&(dyn error::Error + 'static)> {
-        match self {
-            Self::InvalidInteger(e) => Some(e),
-            Self::InvalidFloat(e) => Some(e),
-            Self::InvalidString(e) => Some(e),
-            Self::InvalidGenotype(e) => Some(e),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             ParseError::InvalidNumberForType(number, ty) => {
                 write!(f, "invalid number {number:?} for type {ty:?}")

*** result: Success
