*** src/record.rs:115:9: replace <impl crate::variant::Record for Record>::variant_start -> Option<io::Result<Position>> with None

*** mutation diff:
--- src/record.rs
+++ replace <impl crate::variant::Record for Record>::variant_start -> Option<io::Result<Position>> with None
@@ -107,17 +107,17 @@
 }
 
 impl crate::variant::Record for Record {
     fn reference_sequence_name<'a, 'h: 'a>(&'a self, _: &'h Header) -> io::Result<&'a str> {
         Ok(self.reference_sequence_name())
     }
 
     fn variant_start(&self) -> Option<io::Result<Position>> {
-        self.variant_start()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn ids(&self) -> Box<dyn crate::variant::record::Ids + '_> {
         Box::new(self.ids())
     }
 
     fn reference_bases(&self) -> Box<dyn crate::variant::record::ReferenceBases + '_> {
         Box::new(self.reference_bases())

*** result: Success
