*** src/record/info.rs:23:9: replace Info<'r>::get -> Option<io::Result<Option<Value<'r>>>> with Some(Ok(None))

*** mutation diff:
--- src/record/info.rs
+++ replace Info<'r>::get -> Option<io::Result<Option<Value<'r>>>> with Some(Ok(None))
@@ -15,28 +15,17 @@
     }
 
     /// Returns the value with the given key.
     pub fn get<'h: 'r>(
         &'r self,
         header: &'h Header,
         key: &str,
     ) -> Option<io::Result<Option<Value<'r>>>> {
-        for result in self.iter(header) {
-            match result {
-                Ok((k, v)) => {
-                    if k == key {
-                        return Some(Ok(v));
-                    }
-                }
-                Err(e) => return Some(Err(e)),
-            }
-        }
-
-        None
+        Some(Ok(None)) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns an iterator over all fields.
     pub fn iter<'h: 'r>(
         &'r self,
         header: &'h Header,
     ) -> impl Iterator<Item = io::Result<(&'r str, Option<Value<'r>>)>> + 'r {
         let mut src = self.0;

*** result: Success
