*** src/io/reader/record_buf.rs:91:14: replace != with == in parse_record_buf

*** mutation diff:
--- src/io/reader/record_buf.rs
+++ replace != with == in parse_record_buf
@@ -83,17 +83,17 @@
     let field = next_field(&mut s);
     parse_reference_sequence_name(field, record.reference_sequence_name_mut());
 
     let field = next_field(&mut s);
     *record.variant_start_mut() = parse_position(field).map_err(ParseError::InvalidPosition)?;
 
     record.ids_mut().as_mut().clear();
     let field = next_field(&mut s);
-    if field != MISSING {
+    if field == /* ~ changed by cargo-mutants ~ */ MISSING {
         parse_ids(field, record.ids_mut()).map_err(ParseError::InvalidIds)?;
     }
 
     let field = next_field(&mut s);
     parse_reference_bases(field, record.reference_bases_mut())
         .map_err(ParseError::InvalidReferenceBases)?;
 
     record.alternate_bases_mut().as_mut().clear();

*** result: Success
