*** src/io/reader/record.rs:58:5: replace read_required_field -> io::Result<usize> with Ok(0)

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_required_field -> io::Result<usize> with Ok(0)
@@ -50,23 +50,17 @@
 
     Ok(len)
 }
 
 fn read_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<usize>
 where
     R: BufRead,
 {
-    let (len, is_eol) = read_field(reader, dst)?;
-
-    if is_eol {
-        Err(io::Error::new(io::ErrorKind::InvalidData, "unexpected EOL"))
-    } else {
-        Ok(len)
-    }
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_last_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
     read_field(reader, dst)
 }

*** result: Success
