*** src/io/reader/record.rs:71:5: replace read_last_required_field -> io::Result<(usize, bool)> with Ok((1, true))

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_last_required_field -> io::Result<(usize, bool)> with Ok((1, true))
@@ -63,17 +63,17 @@
         Ok(len)
     }
 }
 
 fn read_last_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
-    read_field(reader, dst)
+    Ok((1, true)) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
     use memchr::memchr2;

---- corpus_oracle stdout ----

thread 'corpus_oracle' (299795) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 2 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=1/samples=3/err=unexpected EOL
  kept_203f0667e0bd7d43.vcf: accepted=true/records=30/samples=2/err= → accepted=false/records=1/samples=2/err=unexpected EOL

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.69s

*** result: Failure(101)
