*** src/io/reader/record.rs:78:5: replace read_field -> io::Result<(usize, bool)> with Ok((0, true))

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_field -> io::Result<(usize, bool)> with Ok((0, true))
@@ -70,55 +70,17 @@
 {
     read_field(reader, dst)
 }
 
 fn read_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
-    use memchr::memchr2;
-
-    const DELIMITER: u8 = b'\t';
-    const LINE_FEED: u8 = b'\n';
-    const CARRIAGE_RETURN: u8 = b'\r';
-
-    let mut r#match = None;
-    let mut len = 0;
-
-    loop {
-        let src = reader.fill_buf()?;
-
-        if r#match.is_some() || src.is_empty() {
-            break;
-        }
-
-        let (mut buf, n) = match memchr2(DELIMITER, LINE_FEED, src) {
-            Some(i) => {
-                r#match = Some(src[i]);
-                (&src[..i], i + 1)
-            }
-            None => (src, src.len()),
-        };
-
-        if let [head @ .., CARRIAGE_RETURN] = buf {
-            buf = head;
-        }
-
-        let s = str::from_utf8(buf).map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
-        dst.push_str(s);
-
-        len += n;
-
-        reader.consume(n);
-    }
-
-    let is_eol = matches!(r#match, Some(LINE_FEED));
-
-    Ok((len, is_eol))
+    Ok((0, true)) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::record::fields::Bounds;
 
     #[test]

---- corpus_oracle stdout ----

thread 'corpus_oracle' (303671) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 2 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=0/samples=3/err=unexpected EOL
  kept_203f0667e0bd7d43.vcf: accepted=true/records=30/samples=2/err= → accepted=false/records=0/samples=2/err=unexpected EOL

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
