*** src/record.rs:111:9: replace <impl crate::variant::Record for Record>::reference_sequence_name -> io::Result<&'a str> with Ok("")

*** mutation diff:
--- src/record.rs
+++ replace <impl crate::variant::Record for Record>::reference_sequence_name -> io::Result<&'a str> with Ok("")
@@ -103,17 +103,17 @@
         let mut record = Self::default();
         reader.read_record(&mut record)?;
         Ok(record)
     }
 }
 
 impl crate::variant::Record for Record {
     fn reference_sequence_name<'a, 'h: 'a>(&'a self, _: &'h Header) -> io::Result<&'a str> {
-        Ok(self.reference_sequence_name())
+        Ok("") /* ~ changed by cargo-mutants ~ */
     }
 
     fn variant_start(&self) -> Option<io::Result<Position>> {
         self.variant_start()
     }
 
     fn ids(&self) -> Box<dyn crate::variant::record::Ids + '_> {
         Box::new(self.ids())

*** result: Success
