*** src/record/samples.rs:44:9: replace Samples<'r>::get_index -> Option<Sample<'r>> with None

*** mutation diff:
--- src/record/samples.rs
+++ replace Samples<'r>::get_index -> Option<Sample<'r>> with None
@@ -36,17 +36,17 @@
         header
             .sample_names()
             .get_index_of(sample_name)
             .and_then(|i| self.get_index(i))
     }
 
     /// Returns the sample at the given index.
     pub fn get_index(&self, i: usize) -> Option<Sample<'r>> {
-        self.iter().nth(i)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the series with the given column name.
     pub fn select(&'r self, column_name: &str) -> Option<Series<'r>> {
         self.keys()
             .iter()
             .enumerate()
             .find(|(_, key)| *key == column_name)

*** result: Success
