*** src/io/reader/header.rs:76:5: replace read_header -> io::Result<Header> with Ok(Default::default())

*** mutation diff:
--- src/io/reader/header.rs
+++ replace read_header -> io::Result<Header> with Ok(Default::default())
@@ -68,30 +68,17 @@
         self.inner.consume(amt);
     }
 }
 
 pub(super) fn read_header<R>(reader: &mut R) -> io::Result<Header>
 where
     R: BufRead,
 {
-    let mut reader = Reader::new(reader);
-
-    let mut parser = header::Parser::default();
-    let mut buf = Vec::new();
-
-    while read_line(&mut reader, &mut buf)? != 0 {
-        parser
-            .parse_partial(&buf)
-            .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
-    }
-
-    parser
-        .finish()
-        .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_line<R>(reader: &mut R, dst: &mut Vec<u8>) -> io::Result<usize>
 where
     R: BufRead,
 {
     const LINE_FEED: u8 = b'\n';
     const CARRIAGE_RETURN: u8 = b'\r';

---- corpus_oracle stdout ----

thread 'corpus_oracle' (230022) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 119 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=0/samples=0/err=unexpected EOL
  htsjdk_HiSeq.10000.vcf: accepted=false/records=0/samples=0/err=duplicate FILTER ID: LowQual → accepted=false/records=0/samples=0/err=unexpected EOL
  htsjdk_dbsnp_135.b37.1000.vcf: accepted=false/records=0/samples=0/err=invalid header: expected FORMAT, got  → accepted=false/records=0/samples=0/err=unexpected EOL
  htsjdk_ex2.vcf: accepted=false/records=0/samples=0/err=invalid record → accepted=false/records=0/samples=0/err=unexpected EOL
  kept_0034d7b11c78c8e3.vcf: accepted=false/records=0/samples=0/err=missing fileformat → accepted=false/records=0/samples=0/err=unexpected EOL

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
