*** src/io/reader/record_buf/samples/values/value.rs:38:13: delete match arm Self::InvalidGenotype(e) in <impl error::Error for ParseError>::source

*** mutation diff:
--- src/io/reader/record_buf/samples/values/value.rs
+++ delete match arm Self::InvalidGenotype(e) in <impl error::Error for ParseError>::source
@@ -30,17 +30,17 @@
 }
 
 impl error::Error for ParseError {
     fn source(&self) -> Option<&(dyn error::Error + 'static)> {
         match self {
             Self::InvalidInteger(e) => Some(e),
             Self::InvalidFloat(e) => Some(e),
             Self::InvalidString(e) => Some(e),
-            Self::InvalidGenotype(e) => Some(e),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 }
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {

*** result: Success
