*** src/record/ids.rs:21:9: replace <impl crate::variant::record::Ids for Ids<'_>>::is_empty -> bool with false

*** mutation diff:
--- src/record/ids.rs
+++ replace <impl crate::variant::record::Ids for Ids<'_>>::is_empty -> bool with false
@@ -13,17 +13,17 @@
 impl AsRef<str> for Ids<'_> {
     fn as_ref(&self) -> &str {
         self.0
     }
 }
 
 impl crate::variant::record::Ids for Ids<'_> {
     fn is_empty(&self) -> bool {
-        self.0.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn len(&self) -> usize {
         self.iter().count()
     }
 
     fn iter(&self) -> Box<dyn Iterator<Item = &str> + '_> {
         const DELIMITER: char = ';';

*** result: Success
