*** src/io/reader/header.rs:32:12: delete ! in <impl Read for Reader<R>>::read

*** mutation diff:
--- src/io/reader/header.rs
+++ delete ! in <impl Read for Reader<R>>::read
@@ -24,17 +24,17 @@
 impl<R> Read for Reader<R>
 where
     R: BufRead,
 {
     fn read(&mut self, buf: &mut [u8]) -> io::Result<usize> {
         let mut src = self.fill_buf()?;
         let amt = src.read(buf)?;
 
-        if !src.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */src.is_empty() {
             self.is_eol = false;
         }
 
         self.consume(amt);
 
         Ok(amt)
     }
 }

*** result: Success
