*** src/io/reader/header.rs:47:9: replace <impl BufRead for Reader<R>>::fill_buf -> io::Result<&[u8]> with Ok(Vec::leak(Vec::new()))

*** mutation diff:
--- src/io/reader/header.rs
+++ replace <impl BufRead for Reader<R>>::fill_buf -> io::Result<&[u8]> with Ok(Vec::leak(Vec::new()))
@@ -39,34 +39,17 @@
     }
 }
 
 impl<R> BufRead for Reader<R>
 where
     R: BufRead,
 {
     fn fill_buf(&mut self) -> io::Result<&[u8]> {
-        use memchr::memchr;
-
-        const PREFIX: u8 = b'#';
-        const LINE_FEED: u8 = b'\n';
-
-        let src = self.inner.fill_buf()?;
-
-        let buf = if self.is_eol && src.first().map(|&b| b != PREFIX).unwrap_or(true) {
-            &[]
-        } else if let Some(i) = memchr(LINE_FEED, src) {
-            self.is_eol = true;
-            &src[..=i]
-        } else {
-            self.is_eol = false;
-            src
-        };
-
-        Ok(buf)
+        Ok(Vec::leak(Vec::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     fn consume(&mut self, amt: usize) {
         self.inner.consume(amt);
     }
 }
 
 pub(super) fn read_header<R>(reader: &mut R) -> io::Result<Header>

---- corpus_oracle stdout ----

thread 'corpus_oracle' (218492) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 120 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=0/samples=0/err=empty input
  htsjdk_HiSeq.10000.vcf: accepted=false/records=0/samples=0/err=duplicate FILTER ID: LowQual → accepted=false/records=0/samples=0/err=empty input
  htsjdk_dbsnp_135.b37.1000.vcf: accepted=false/records=0/samples=0/err=invalid header: expected FORMAT, got  → accepted=false/records=0/samples=0/err=empty input
  htsjdk_ex2.vcf: accepted=false/records=0/samples=0/err=invalid record → accepted=false/records=0/samples=0/err=empty input
  kept_00b2b11c189b72d2.vcf: accepted=false/records=0/samples=0/err=missing fileformat → accepted=false/records=0/samples=0/err=empty input

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
