*** src/io/reader/query.rs:69:5: replace intersects -> io::Result<bool> with Ok(true)

*** mutation diff:
--- src/io/reader/query.rs
+++ replace intersects -> io::Result<bool> with Ok(true)
@@ -61,26 +61,17 @@
 }
 
 pub(crate) fn intersects(
     header: &Header,
     record: &Record,
     reference_sequence_name: &[u8],
     region_interval: Interval,
 ) -> io::Result<bool> {
-    let name = record.reference_sequence_name();
-
-    let Some(start) = record.variant_start().transpose()? else {
-        return Ok(false);
-    };
-
-    let end = record.variant_end(header)?;
-    let record_interval = Interval::from(start..=end);
-
-    Ok(name.as_bytes() == reference_sequence_name && record_interval.intersects(region_interval))
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn next_record<R>(
     reader: &mut Reader<csi::io::Query<'_, R>>,
     record: &mut Record,
     header: &Header,
     reference_sequence_name: &[u8],
     interval: Interval,

*** result: Success
