*** src/io/reader/record_buf/info/field/value.rs:42:9: replace <impl fmt::Display for ParseError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/io/reader/record_buf/info/field/value.rs
+++ replace <impl fmt::Display for ParseError>::fmt -> fmt::Result with Ok(Default::default())
@@ -34,26 +34,17 @@
             Self::InvalidString(e) => Some(e),
             _ => None,
         }
     }
 }
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            ParseError::InvalidNumberForType(number, ty) => {
-                write!(f, "invalid number {number:?} for type {ty:?}")
-            }
-            ParseError::InvalidInteger(_) => write!(f, "invalid integer"),
-            ParseError::InvalidFloat(_) => write!(f, "invalid float"),
-            ParseError::InvalidFlag => write!(f, "invalid flag"),
-            ParseError::InvalidCharacter => write!(f, "invalid character"),
-            ParseError::InvalidString(_) => write!(f, "invalid string"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(super) fn parse_value(number: Number, ty: Type, s: &str) -> Result<Value, ParseError> {
     match (number, ty) {
         (Number::Count(0), Type::Flag) => parse_flag(s),
         (Number::Count(0), _) | (_, Type::Flag) => {
             Err(ParseError::InvalidNumberForType(number, ty))

*** result: Success
