*** src/record/samples/series/value/genotype.rs:66:5: replace next_allele -> &'a str with "xyzzy"

*** mutation diff:
--- src/record/samples/series/value/genotype.rs
+++ replace next_allele -> &'a str with "xyzzy"
@@ -58,24 +58,17 @@
 
     let phasing = parse_phasing(&buf[..1])?;
     let position = parse_position(&buf[1..])?;
 
     Ok((position, phasing))
 }
 
 fn next_allele<'a>(src: &mut &'a str) -> &'a str {
-    let (buf, rest) = match src.chars().skip(1).position(is_phasing_indicator) {
-        Some(i) => src.split_at(i + 1),
-        None => src.split_at(src.len()),
-    };
-
-    *src = rest;
-
-    buf
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_phasing_indicator(c: char) -> bool {
     const PHASED: char = '|';
     const UNPHASED: char = '/';
 
     matches!(c, PHASED | UNPHASED)
 }

*** result: Success
