*** src/io/reader/header.rs:47:9: replace <impl BufRead for Reader<R>>::fill_buf -> io::Result<&[u8]> with Ok(Vec::leak(vec![0]))

*** mutation diff:
--- src/io/reader/header.rs
+++ replace <impl BufRead for Reader<R>>::fill_buf -> io::Result<&[u8]> with Ok(Vec::leak(vec![0]))
@@ -39,34 +39,17 @@
     }
 }
 
 impl<R> BufRead for Reader<R>
 where
     R: BufRead,
 {
     fn fill_buf(&mut self) -> io::Result<&[u8]> {
-        use memchr::memchr;
-
-        const PREFIX: u8 = b'#';
-        const LINE_FEED: u8 = b'\n';
-
-        let src = self.inner.fill_buf()?;
-
-        let buf = if self.is_eol && src.first().map(|&b| b != PREFIX).unwrap_or(true) {
-            &[]
-        } else if let Some(i) = memchr(LINE_FEED, src) {
-            self.is_eol = true;
-            &src[..=i]
-        } else {
-            self.is_eol = false;
-            src
-        };
-
-        Ok(buf)
+        Ok(Vec::leak(vec![0])) /* ~ changed by cargo-mutants ~ */
     }
 
     fn consume(&mut self, amt: usize) {
         self.inner.consume(amt);
     }
 }
 
 pub(super) fn read_header<R>(reader: &mut R) -> io::Result<Header>

*** result: Failure(101)
