*** src/io/reader/record_buf/info/field.rs:25:9: replace ParseError::key -> Option<&str> with Some("")

*** mutation diff:
--- src/io/reader/record_buf/info/field.rs
+++ replace ParseError::key -> Option<&str> with Some("")
@@ -17,20 +17,17 @@
     MissingValue(String),
     /// A value is invalid.
     InvalidValue(String, value::ParseError),
 }
 
 impl ParseError {
     /// Returns the key of the field that caused the failure.
     pub fn key(&self) -> Option<&str> {
-        match self {
-            Self::MissingValue(key) => Some(key),
-            Self::InvalidValue(key, _) => Some(key),
-        }
+        Some("") /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl error::Error for ParseError {
     fn source(&self) -> Option<&(dyn error::Error + 'static)> {
         match self {
             Self::InvalidValue(_, e) => Some(e),
             _ => None,

*** result: Success
