*** src/io/reader/record.rs:71:5: replace read_last_required_field -> io::Result<(usize, bool)> with Ok((0, true))

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_last_required_field -> io::Result<(usize, bool)> with Ok((0, true))
@@ -63,17 +63,17 @@
         Ok(len)
     }
 }
 
 fn read_last_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
-    read_field(reader, dst)
+    Ok((0, true)) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
     use memchr::memchr2;

---- corpus_oracle stdout ----

thread 'corpus_oracle' (295919) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 10 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=1/samples=3/err=unexpected EOL
  kept_58ff8ef6f4891431.vcf: accepted=true/records=18/samples=2/err= → accepted=false/records=1/samples=2/err=unexpected EOL
  kept_59c0607bd55858c7.vcf: accepted=true/records=16/samples=3/err= → accepted=false/records=1/samples=3/err=unexpected EOL
  kept_6156cd744450fc8c.vcf: accepted=true/records=5/samples=1/err= → accepted=false/records=1/samples=1/err=unexpected EOL
  kept_97561b94f70ebaa8.vcf: accepted=true/records=7/samples=3/err= → accepted=false/records=1/samples=3/err=unexpected EOL

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
