*** src/io/reader/record.rs:78:5: replace read_field -> io::Result<(usize, bool)> with Ok((1, false))

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_field -> io::Result<(usize, bool)> with Ok((1, false))
@@ -70,55 +70,17 @@
 {
     read_field(reader, dst)
 }
 
 fn read_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
-    use memchr::memchr2;
-
-    const DELIMITER: u8 = b'\t';
-    const LINE_FEED: u8 = b'\n';
-    const CARRIAGE_RETURN: u8 = b'\r';
-
-    let mut r#match = None;
-    let mut len = 0;
-
-    loop {
-        let src = reader.fill_buf()?;
-
-        if r#match.is_some() || src.is_empty() {
-            break;
-        }
-
-        let (mut buf, n) = match memchr2(DELIMITER, LINE_FEED, src) {
-            Some(i) => {
-                r#match = Some(src[i]);
-                (&src[..i], i + 1)
-            }
-            None => (src, src.len()),
-        };
-
-        if let [head @ .., CARRIAGE_RETURN] = buf {
-            buf = head;
-        }
-
-        let s = str::from_utf8(buf).map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
-        dst.push_str(s);
-
-        len += n;
-
-        reader.consume(n);
-    }
-
-    let is_eol = matches!(r#match, Some(LINE_FEED));
-
-    Ok((len, is_eol))
+    Ok((1, false)) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::record::fields::Bounds;
 
     #[test]

*** result: Timeout
