*** src/record.rs:36:9: replace Record::reference_sequence_name -> &str with "xyzzy"

*** mutation diff:
--- src/record.rs
+++ replace Record::reference_sequence_name -> &str with "xyzzy"
@@ -28,17 +28,17 @@
     }
 
     pub(crate) fn fields_mut(&mut self) -> &mut Fields {
         &mut self.0
     }
 
     /// Returns the reference sequence name.
     pub fn reference_sequence_name(&self) -> &str {
-        self.0.reference_sequence_name()
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the variant start position.
     pub fn variant_start(&self) -> Option<io::Result<Position>> {
         self.0.variant_start()
     }
 
     /// Returns the IDs.

*** result: Success
