*** src/record/fields.rs:49:9: replace Fields::reference_bases -> &str with "xyzzy"

*** mutation diff:
--- src/record/fields.rs
+++ replace Fields::reference_bases -> &str with "xyzzy"
@@ -41,17 +41,17 @@
             MISSING => "",
             buf => buf,
         };
 
         Ids::new(src)
     }
 
     pub(super) fn reference_bases(&self) -> &str {
-        &self.buf[self.bounds.reference_bases_range()]
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub(super) fn alternate_bases(&self) -> AlternateBases {
         let src = match &self.buf[self.bounds.alternate_bases_range()] {
             MISSING => "",
             buf => buf,
         };

*** result: Success
