*** src/record/ids.rs:25:9: replace <impl crate::variant::record::Ids for Ids<'_>>::len -> usize with 1

*** mutation diff:
--- src/record/ids.rs
+++ replace <impl crate::variant::record::Ids for Ids<'_>>::len -> usize with 1
@@ -17,17 +17,17 @@
 }
 
 impl crate::variant::record::Ids for Ids<'_> {
     fn is_empty(&self) -> bool {
         self.0.is_empty()
     }
 
     fn len(&self) -> usize {
-        self.iter().count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn iter(&self) -> Box<dyn Iterator<Item = &str> + '_> {
         const DELIMITER: char = ';';
 
         if self.is_empty() {
             return Box::new(iter::empty());
         }

*** result: Success
