*** src/record/info.rs:42:9: replace Info<'r>::iter -> impl Iterator<Item = io::Result<(&'r str, Option<Value<'r>>)>>+'r with ::std::iter::once(Ok(("", None)))

*** mutation diff:
--- src/record/info.rs
+++ replace Info<'r>::iter -> impl Iterator<Item = io::Result<(&'r str, Option<Value<'r>>)>>+'r with ::std::iter::once(Ok(("", None)))
@@ -34,25 +34,17 @@
         None
     }
 
     /// Returns an iterator over all fields.
     pub fn iter<'h: 'r>(
         &'r self,
         header: &'h Header,
     ) -> impl Iterator<Item = io::Result<(&'r str, Option<Value<'r>>)>> + 'r {
-        let mut src = self.0;
-
-        iter::from_fn(move || {
-            if src.is_empty() {
-                None
-            } else {
-                Some(parse_field(&mut src, header))
-            }
-        })
+        ::std::iter::once(Ok(("", None))) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl AsRef<str> for Info<'_> {
     fn as_ref(&self) -> &str {
         self.0
     }
 }

*** result: Success
