*** src/header.rs:463:9: replace Header::get -> Option<&record::value::Collection> with None

*** mutation diff:
--- src/header.rs
+++ replace Header::get -> Option<&record::value::Collection> with None
@@ -455,17 +455,17 @@
     ///
     /// assert!(header.get("reference").is_none());
     /// # Ok::<_, Box<dyn std::error::Error>>(())
     /// ```
     pub fn get<Q>(&self, key: &Q) -> Option<&record::value::Collection>
     where
         Q: ?Sized + Hash + indexmap::Equivalent<record::key::Other>,
     {
-        self.other_records.get(key)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Inserts a key-value pair representing a nonstandard record into the header.
     ///
     /// # Examples
     ///
     /// ```
     /// use noodles_vcf::{

*** result: Success
