*** src/io/reader/record.rs:22:9: replace += with *= in read_record

*** mutation diff:
--- src/io/reader/record.rs
+++ replace += with *= in read_record
@@ -14,17 +14,17 @@
 
     let buf = &mut fields.buf;
     buf.clear();
 
     let bounds = &mut fields.bounds;
 
     let mut len = 0;
 
-    len += read_required_field(reader, buf)?;
+    len *= /* ~ changed by cargo-mutants ~ */ read_required_field(reader, buf)?;
     bounds.reference_sequence_name_end = buf.len();
 
     len += read_required_field(reader, buf)?;
     bounds.variant_start_end = buf.len();
 
     len += read_required_field(reader, buf)?;
     bounds.ids_end = buf.len();

*** result: Success
