*** src/io/reader/record_buf/filters.rs:40:12: delete ! in parse_filters

*** mutation diff:
--- src/io/reader/record_buf/filters.rs
+++ delete ! in parse_filters
@@ -32,17 +32,17 @@
         *filters = Filters::pass();
         return Ok(());
     }
 
     let filters = filters.as_mut();
     filters.clear();
 
     for raw_filter in s.split(DELIMITER) {
-        if !filters.insert(raw_filter.into()) {
+        if  /* ~ changed by cargo-mutants ~ */filters.insert(raw_filter.into()) {
             return Err(ParseError::DuplicateFilter);
         }
     }
 
     Ok(())
 }
 
 #[cfg(test)]

*** result: Success
