*** src/io/reader/record_buf/samples/values.rs:30:9: replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None

*** mutation diff:
--- src/io/reader/record_buf/samples/values.rs
+++ replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None
@@ -22,20 +22,17 @@
     /// The value was unexpected.
     ///
     /// There are unexpectedly more values than keys.
     UnexpectedValue,
 }
 
 impl error::Error for ParseError {
     fn source(&self) -> Option<&(dyn error::Error + 'static)> {
-        match self {
-            Self::InvalidValue(e) => Some(e),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             Self::Empty => f.write_str("empty input"),
             Self::InvalidValue(_) => f.write_str("invalid value"),

*** result: Success
