*** src/record/samples/series/value/genotype.rs:101:9: delete match arm MISSING in parse_position

*** mutation diff:
--- src/record/samples/series/value/genotype.rs
+++ delete match arm MISSING in parse_position
@@ -93,17 +93,17 @@
         )),
     }
 }
 
 fn parse_position(src: &str) -> io::Result<Option<usize>> {
     const MISSING: &str = ".";
 
     match src {
-        MISSING => Ok(None),
+         /* ~ changed by cargo-mutants ~ */
         _ => src
             .parse()
             .map(Some)
             .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e)),
     }
 }
 
 #[cfg(test)]

*** result: Success
