*** src/io/reader/record_buf/filters.rs:26:5: replace parse_filters -> Result<(), ParseError> with Ok(())

*** mutation diff:
--- src/io/reader/record_buf/filters.rs
+++ replace parse_filters -> Result<(), ParseError> with Ok(())
@@ -18,36 +18,17 @@
         match self {
             Self::Empty => write!(f, "empty input"),
             Self::DuplicateFilter => write!(f, "duplicate filter"),
         }
     }
 }
 
 pub(super) fn parse_filters(s: &str, filters: &mut Filters) -> Result<(), ParseError> {
-    const DELIMITER: char = ';';
-    const PASS: &str = "PASS";
-
-    if s.is_empty() {
-        return Err(ParseError::Empty);
-    } else if s == PASS {
-        *filters = Filters::pass();
-        return Ok(());
-    }
-
-    let filters = filters.as_mut();
-    filters.clear();
-
-    for raw_filter in s.split(DELIMITER) {
-        if !filters.insert(raw_filter.into()) {
-            return Err(ParseError::DuplicateFilter);
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_parse_filters() -> Result<(), ParseError> {

*** result: Success
