*** src/record.rs:82:9: replace <impl fmt::Debug for Record>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/record.rs
+++ replace <impl fmt::Debug for Record>::fmt -> fmt::Result with Ok(Default::default())
@@ -74,27 +74,17 @@
     /// Returns the samples.
     pub fn samples(&self) -> Samples<'_> {
         self.0.samples()
     }
 }
 
 impl fmt::Debug for Record {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.debug_struct("Record")
-            .field("reference_sequence_name", &self.reference_sequence_name())
-            .field("variant_start", &self.variant_start())
-            .field("ids", &self.ids())
-            .field("reference_bases", &self.reference_bases())
-            .field("alternate_bases", &self.alternate_bases())
-            .field("quality_score", &self.quality_score())
-            .field("filters", &self.filters())
-            .field("info", &self.info())
-            .field("samples", &self.samples())
-            .finish()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TryFrom<&[u8]> for Record {
     type Error = io::Error;
 
     fn try_from(buf: &[u8]) -> Result<Self, Self::Error> {
         use crate::io::Reader;

*** result: Success
