*** src/record/samples.rs:36:9: replace Samples<'r>::get -> Option<Sample<'r>> with None

*** mutation diff:
--- src/record/samples.rs
+++ replace Samples<'r>::get -> Option<Sample<'r>> with None
@@ -28,20 +28,17 @@
     /// Returns the keys.
     pub fn keys(&self) -> Keys<'r> {
         let (src, _) = self.0.split_once(DELIMITER).unwrap_or_default();
         Keys::new(src)
     }
 
     /// Returns the sample with the given sample name.
     pub fn get(&self, header: &Header, sample_name: &str) -> Option<Sample<'r>> {
-        header
-            .sample_names()
-            .get_index_of(sample_name)
-            .and_then(|i| self.get_index(i))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the sample at the given index.
     pub fn get_index(&self, i: usize) -> Option<Sample<'r>> {
         self.iter().nth(i)
     }
 
     /// Returns the series with the given column name.

*** result: Success
