*** src/io/reader/record_buf/ids.rs:21:9: replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None

*** mutation diff:
--- src/io/reader/record_buf/ids.rs
+++ replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None
@@ -13,20 +13,17 @@
     /// An ID is invalid.
     InvalidId(id::ParseError),
     /// An ID is duplicated.
     DuplicateId(String),
 }
 
 impl error::Error for ParseError {
     fn source(&self) -> Option<&(dyn error::Error + 'static)> {
-        match self {
-            Self::InvalidId(e) => Some(e),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             Self::Empty => write!(f, "empty input"),
             Self::InvalidId(_) => write!(f, "invalid ID"),

*** result: Success
