*** src/header.rs:361:9: replace Header::sample_names -> &SampleNames with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/header.rs
+++ replace Header::sample_names -> &SampleNames with Box::leak(Box::new(Default::default()))
@@ -353,17 +353,17 @@
     ///
     /// let expected: IndexSet<_> = [String::from("sample0"), String::from("sample1")]
     ///     .into_iter()
     ///     .collect();
     ///
     /// assert_eq!(header.sample_names(), &expected);
     /// ```
     pub fn sample_names(&self) -> &SampleNames {
-        &self.sample_names
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns a mutable reference to a list of sample names that come after the FORMAT column in
     /// the header record.
     ///
     /// # Examples
     ///
     /// ```

---- corpus_oracle stdout ----

thread 'corpus_oracle' (29921) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 94 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=true/records=15/samples=0/err=
  minimal_multisample.vcf: accepted=true/records=2/samples=2/err= → accepted=true/records=2/samples=0/err=
  minimal_single.vcf: accepted=true/records=1/samples=1/err= → accepted=true/records=1/samples=0/err=
  rawfuzz_01f17d956e368da7.vcf: accepted=false/records=0/samples=2/err=unexpected EOL → accepted=false/records=0/samples=0/err=unexpected EOL
  rawfuzz_023ad76cd4c0d94a.vcf: accepted=false/records=0/samples=3/err=unexpected EOL → accepted=false/records=0/samples=0/err=unexpected EOL

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
