*** src/io/reader/record.rs:97:31: replace + with * in read_field

*** mutation diff:
--- src/io/reader/record.rs
+++ replace + with * in read_field
@@ -89,17 +89,17 @@
 
         if r#match.is_some() || src.is_empty() {
             break;
         }
 
         let (mut buf, n) = match memchr2(DELIMITER, LINE_FEED, src) {
             Some(i) => {
                 r#match = Some(src[i]);
-                (&src[..i], i + 1)
+                (&src[..i], i * /* ~ changed by cargo-mutants ~ */ 1)
             }
             None => (src, src.len()),
         };
 
         if let [head @ .., CARRIAGE_RETURN] = buf {
             buf = head;
         }

---- corpus_oracle stdout ----

thread 'corpus_oracle' (315299) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 4 of 120 files; first up-to-5:
  rawfuzz_1b260b1e78a0be5d.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 30 → accepted=false/records=0/samples=1/err=stream did not contain valid UTF-8
  rawfuzz_1d155b472ecf3d85.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 42 → accepted=false/records=0/samples=1/err=stream did not contain valid UTF-8
  rawfuzz_25c1cf213e3f2747.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 27 → accepted=false/records=0/samples=1/err=stream did not contain valid UTF-8
  rawfuzz_32b61fba23e4f854.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 56 → accepted=false/records=0/sa

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
