*** src/io/reader/header.rs:68:9: replace <impl BufRead for Reader<R>>::consume with ()

*** mutation diff:
--- src/io/reader/header.rs
+++ replace <impl BufRead for Reader<R>>::consume with ()
@@ -60,17 +60,17 @@
             self.is_eol = false;
             src
         };
 
         Ok(buf)
     }
 
     fn consume(&mut self, amt: usize) {
-        self.inner.consume(amt);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(super) fn read_header<R>(reader: &mut R) -> io::Result<Header>
 where
     R: BufRead,
 {
     let mut reader = Reader::new(reader);

---- corpus_oracle stdout ----

thread 'corpus_oracle' (228166) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 120 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=0/samples=0/err=unexpected file format
  htsjdk_HiSeq.10000.vcf: accepted=false/records=0/samples=0/err=duplicate FILTER ID: LowQual → accepted=false/records=0/samples=0/err=unexpected file format
  htsjdk_dbsnp_135.b37.1000.vcf: accepted=false/records=0/samples=0/err=invalid header: expected FORMAT, got  → accepted=false/records=0/samples=0/err=unexpected file format
  htsjdk_ex2.vcf: accepted=false/records=0/samples=0/err=invalid record → accepted=false/records=0/samples=0/err=unexpected file format
  minimal_multisample.vcf: accepted=true/records=2/samples=2/err= → accepted=false/records=0/samples=0/err=unexpected file format

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
