*** src/io/reader/record.rs:34:9: replace += with -= in read_record

*** mutation diff:
--- src/io/reader/record.rs
+++ replace += with -= in read_record
@@ -26,17 +26,17 @@
     bounds.variant_start_end = buf.len();
 
     len += read_required_field(reader, buf)?;
     bounds.ids_end = buf.len();
 
     len += read_required_field(reader, buf)?;
     bounds.reference_bases_end = buf.len();
 
-    len += read_required_field(reader, buf)?;
+    len -= /* ~ changed by cargo-mutants ~ */ read_required_field(reader, buf)?;
     bounds.alternate_bases_end = buf.len();
 
     len += read_required_field(reader, buf)?;
     bounds.quality_score_end = buf.len();
 
     len += read_required_field(reader, buf)?;
     bounds.filters_end = buf.len();

*** result: Success
