*** src/io/reader/record.rs:47:8: delete ! in read_record

*** mutation diff:
--- src/io/reader/record.rs
+++ delete ! in read_record
@@ -39,17 +39,17 @@
 
     len += read_required_field(reader, buf)?;
     bounds.filters_end = buf.len();
 
     let (n, is_eol) = read_last_required_field(reader, buf)?;
     len += n;
     bounds.info_end = buf.len();
 
-    if !is_eol {
+    if  /* ~ changed by cargo-mutants ~ */is_eol {
         len += read_line(reader, buf)?;
     }
 
     Ok(len)
 }
 
 fn read_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<usize>
 where

---- corpus_oracle stdout ----

thread 'corpus_oracle' (286229) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 6 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=1/samples=3/err=unexpected EOL
  minimal_multisample.vcf: accepted=true/records=2/samples=2/err= → accepted=false/records=1/samples=2/err=unexpected EOL
  minimal_single.vcf: accepted=true/records=1/samples=1/err= → accepted=false/records=1/samples=1/err=unexpected EOL
  rawfuzz_313049371fc27a04.vcf: accepted=true/records=1/samples=1/err= → accepted=true/records=2/samples=1/err=
  rawfuzz_475a57e1cb7665b5.vcf: accepted=false/records=0/samples=1/err=stream did not contain valid UTF-8 → accepted=false/records=1/samples=1/err=invalid utf-8 sequence of 1 bytes from index 95

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
