*** src/io/reader/record.rs:71:5: replace read_last_required_field -> io::Result<(usize, bool)> with Ok((0, false))

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_last_required_field -> io::Result<(usize, bool)> with Ok((0, false))
@@ -63,17 +63,17 @@
         Ok(len)
     }
 }
 
 fn read_last_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
-    read_field(reader, dst)
+    Ok((0, false)) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
     use memchr::memchr2;

---- corpus_oracle stdout ----

thread 'corpus_oracle' (297857) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 4 of 120 files; first up-to-5:
  rawfuzz_1b260b1e78a0be5d.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 30 → accepted=false/records=0/samples=1/err=stream did not contain valid UTF-8
  rawfuzz_1d155b472ecf3d85.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 42 → accepted=false/records=0/samples=1/err=stream did not contain valid UTF-8
  rawfuzz_25c1cf213e3f2747.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 27 → accepted=false/records=0/samples=1/err=stream did not contain valid UTF-8
  rawfuzz_32b61fba23e4f854.vcf: accepted=false/records=0/samples=1/err=invalid utf-8 sequence of 1 bytes from index 56 → accepted=false/records=0/sa

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
