*** src/io/reader/record_buf/reference_sequence_name.rs:2:5: replace parse_reference_sequence_name with ()

*** mutation diff:
--- src/io/reader/record_buf/reference_sequence_name.rs
+++ replace parse_reference_sequence_name with ()
@@ -1,11 +1,10 @@
 pub(super) fn parse_reference_sequence_name(s: &str, reference_sequence_name: &mut String) {
-    reference_sequence_name.clear();
-    reference_sequence_name.push_str(s);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_parse_reference_sequence_name() {

*** result: Success
