*** src/io/reader/record_bufs.rs:35:9: replace <impl Iterator for RecordBufs<'_, '_, R>>::next -> Option<Self::Item> with None

*** mutation diff:
--- src/io/reader/record_bufs.rs
+++ replace <impl Iterator for RecordBufs<'_, '_, R>>::next -> Option<Self::Item> with None
@@ -27,15 +27,11 @@
 
 impl<R> Iterator for RecordBufs<'_, '_, R>
 where
     R: BufRead,
 {
     type Item = io::Result<RecordBuf>;
 
     fn next(&mut self) -> Option<Self::Item> {
-        match self.inner.read_record_buf(self.header, &mut self.record) {
-            Ok(0) => None,
-            Ok(_) => Some(Ok(self.record.clone())),
-            Err(e) => Some(Err(e)),
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
