*** src/record/samples/sample.rs:87:9: replace <impl crate::variant::record::samples::Sample for Sample<'_>>::get_index -> Option<io::Result<Option<Value<'a>>>> with None

*** mutation diff:
--- src/record/samples/sample.rs
+++ replace <impl crate::variant::record::samples::Sample for Sample<'_>>::get_index -> Option<io::Result<Option<Value<'a>>>> with None
@@ -79,19 +79,17 @@
         None
     }
 
     fn get_index<'a, 'h: 'a>(
         &'a self,
         header: &'h Header,
         i: usize,
     ) -> Option<io::Result<Option<Value<'a>>>> {
-        self.iter(header)
-            .nth(i)
-            .map(|result| result.map(|(_, value)| value))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn iter<'a, 'h: 'a>(
         &'a self,
         header: &'h Header,
     ) -> Box<dyn Iterator<Item = io::Result<(&'a str, Option<Value<'a>>)>> + 'a> {
         Box::new(self.iter(header))
     }

*** result: Success
