*** src/header.rs:491:9: replace Header::insert -> Result<(), record::value::collection::AddError> with Ok(())

*** mutation diff:
--- src/header.rs
+++ replace Header::insert -> Result<(), record::value::collection::AddError> with Ok(())
@@ -483,25 +483,17 @@
     /// );
     /// # Ok::<_, Box<dyn std::error::Error>>(())
     /// ```
     pub fn insert(
         &mut self,
         key: record::key::Other,
         value: record::Value,
     ) -> Result<(), record::value::collection::AddError> {
-        let collection = self
-            .other_records
-            .entry(key)
-            .or_insert_with(|| match value {
-                record::Value::String(_) => record::value::Collection::Unstructured(Vec::new()),
-                record::Value::Map(..) => record::value::Collection::Structured(IndexMap::new()),
-            });
-
-        collection.add(value)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     #[doc(hidden)]
     pub fn string_maps(&self) -> &StringMaps {
         &self.string_maps
     }
 
     #[doc(hidden)]

*** result: Success
