*** src/io/reader/record_buf/reference_bases.rs:14:9: replace <impl fmt::Display for ParseError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/io/reader/record_buf/reference_bases.rs
+++ replace <impl fmt::Display for ParseError>::fmt -> fmt::Result with Ok(Default::default())
@@ -6,19 +6,17 @@
     /// The input is empty.
     Empty,
 }
 
 impl error::Error for ParseError {}
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Empty => write!(f, "empty input"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(super) fn parse_reference_bases(
     s: &str,
     reference_bases: &mut String,
 ) -> Result<(), ParseError> {
     if s.is_empty() {

*** result: Success
