*** src/record/samples/series/value.rs:22:5: replace parse_value -> io::Result<Option<Value<'a>>> with Ok(None)

*** mutation diff:
--- src/record/samples/series/value.rs
+++ replace parse_value -> io::Result<Option<Value<'a>>> with Ok(None)
@@ -14,51 +14,17 @@
     Header,
 };
 
 pub(crate) fn parse_value<'a>(
     src: &'a str,
     header: &Header,
     key: &str,
 ) -> io::Result<Option<Value<'a>>> {
-    use crate::header::record::value::map::format::{definition::definition, Number, Type};
-
-    const MISSING: &str = ".";
-
-    if src == MISSING {
-        return Ok(None);
-    } else if key == key::GENOTYPE {
-        return Ok(Some(parse_genotype_value(src)));
-    }
-
-    let (number, ty) = header
-        .formats()
-        .get(key)
-        .map(|format| (format.number(), format.ty()))
-        .or_else(|| definition(header.file_format(), key).map(|(n, t, _)| (n, t)))
-        .unwrap_or_default();
-
-    let value = match (number, ty) {
-        (Number::Count(0), _) => {
-            return Err(io::Error::new(
-                io::ErrorKind::InvalidData,
-                "invalid number for type",
-            ))
-        }
-        (Number::Count(1), Type::Integer) => parse_integer_value(src)?,
-        (Number::Count(1), Type::Float) => parse_float_value(src)?,
-        (Number::Count(1), Type::Character) => parse_character_value(src)?,
-        (Number::Count(1), Type::String) => parse_string_value(src)?,
-        (_, Type::Integer) => parse_integer_array_value(src),
-        (_, Type::Float) => parse_float_array_value(src),
-        (_, Type::Character) => parse_character_array_value(src),
-        (_, Type::String) => parse_string_array_value(src),
-    };
-
-    Ok(Some(value))
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_integer_value(src: &str) -> io::Result<Value<'_>> {
     src.parse()
         .map(Value::Integer)
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))
 }

*** result: Success
