*** src/record/samples/series/value/genotype.rs:98:5: replace parse_position -> io::Result<Option<usize>> with Ok(None)

*** mutation diff:
--- src/record/samples/series/value/genotype.rs
+++ replace parse_position -> io::Result<Option<usize>> with Ok(None)
@@ -90,25 +90,17 @@
         _ => Err(io::Error::new(
             io::ErrorKind::InvalidData,
             "invalid phasing indicator",
         )),
     }
 }
 
 fn parse_position(src: &str) -> io::Result<Option<usize>> {
-    const MISSING: &str = ".";
-
-    match src {
-        MISSING => Ok(None),
-        _ => src
-            .parse()
-            .map(Some)
-            .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e)),
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::variant::record::samples::series::value::Genotype as _;
 
     #[test]

*** result: Success
