*** src/header.rs:504:9: replace Header::string_maps -> &StringMaps with Box::leak(Box::new(Default::default()))

*** mutation diff:
--- src/header.rs
+++ replace Header::string_maps -> &StringMaps with Box::leak(Box::new(Default::default()))
@@ -496,17 +496,17 @@
                 record::Value::Map(..) => record::value::Collection::Structured(IndexMap::new()),
             });
 
         collection.add(value)
     }
 
     #[doc(hidden)]
     pub fn string_maps(&self) -> &StringMaps {
-        &self.string_maps
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     #[doc(hidden)]
     pub fn string_maps_mut(&mut self) -> &mut StringMaps {
         &mut self.string_maps
     }
 }

*** result: Success
