*** src/io/reader/header.rs:81:45: replace != with == in read_header

*** mutation diff:
--- src/io/reader/header.rs
+++ replace != with == in read_header
@@ -73,17 +73,17 @@
 where
     R: BufRead,
 {
     let mut reader = Reader::new(reader);
 
     let mut parser = header::Parser::default();
     let mut buf = Vec::new();
 
-    while read_line(&mut reader, &mut buf)? != 0 {
+    while read_line(&mut reader, &mut buf)? == /* ~ changed by cargo-mutants ~ */ 0 {
         parser
             .parse_partial(&buf)
             .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))?;
     }
 
     parser
         .finish()
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))

---- corpus_oracle stdout ----

thread 'corpus_oracle' (231960) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 120 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=0/samples=0/err=empty input
  htsjdk_HiSeq.10000.vcf: accepted=false/records=0/samples=0/err=duplicate FILTER ID: LowQual → accepted=false/records=0/samples=0/err=empty input
  htsjdk_dbsnp_135.b37.1000.vcf: accepted=false/records=0/samples=0/err=invalid header: expected FORMAT, got  → accepted=false/records=0/samples=0/err=empty input
  htsjdk_ex2.vcf: accepted=false/records=0/samples=0/err=invalid record → accepted=false/records=0/samples=0/err=empty input
  minimal_multisample.vcf: accepted=true/records=2/samples=2/err= → accepted=false/records=0/samples=0/err=empty input

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
