*** src/io/reader/header.rs:96:5: replace read_line -> io::Result<usize> with Ok(0)

*** mutation diff:
--- src/io/reader/header.rs
+++ replace read_line -> io::Result<usize> with Ok(0)
@@ -88,35 +88,17 @@
         .finish()
         .map_err(|e| io::Error::new(io::ErrorKind::InvalidData, e))
 }
 
 fn read_line<R>(reader: &mut R, dst: &mut Vec<u8>) -> io::Result<usize>
 where
     R: BufRead,
 {
-    const LINE_FEED: u8 = b'\n';
-    const CARRIAGE_RETURN: u8 = b'\r';
-
-    dst.clear();
-
-    match reader.read_until(LINE_FEED, dst)? {
-        0 => Ok(0),
-        n => {
-            if dst.ends_with(&[LINE_FEED]) {
-                dst.pop();
-
-                if dst.ends_with(&[CARRIAGE_RETURN]) {
-                    dst.pop();
-                }
-            }
-
-            Ok(n)
-        }
-    }
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_read_raw_header() -> io::Result<()> {

---- corpus_oracle stdout ----

thread 'corpus_oracle' (233890) panicked at tests/biotest_corpus_oracle.rs:231:17:
oracle divergence on 120 of 120 files; first up-to-5:
  bcftools_test.vcf: accepted=true/records=15/samples=3/err= → accepted=false/records=0/samples=0/err=empty input
  htsjdk_HiSeq.10000.vcf: accepted=false/records=0/samples=0/err=duplicate FILTER ID: LowQual → accepted=false/records=0/samples=0/err=empty input
  htsjdk_dbsnp_135.b37.1000.vcf: accepted=false/records=0/samples=0/err=invalid header: expected FORMAT, got  → accepted=false/records=0/samples=0/err=empty input
  htsjdk_ex2.vcf: accepted=false/records=0/samples=0/err=invalid record → accepted=false/records=0/samples=0/err=empty input
  minimal_multisample.vcf: accepted=true/records=2/samples=2/err= → accepted=false/records=0/samples=0/err=empty input

failures:
    corpus_oracle

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
