*** src/io/reader/record.rs:71:5: replace read_last_required_field -> io::Result<(usize, bool)> with Ok((1, false))

*** mutation diff:
--- src/io/reader/record.rs
+++ replace read_last_required_field -> io::Result<(usize, bool)> with Ok((1, false))
@@ -63,17 +63,17 @@
         Ok(len)
     }
 }
 
 fn read_last_required_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
-    read_field(reader, dst)
+    Ok((1, false)) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_field<R>(reader: &mut R, dst: &mut String) -> io::Result<(usize, bool)>
 where
     R: BufRead,
 {
     use memchr::memchr2;

*** result: Timeout
