*** src/io/reader/record_buf.rs:65:9: replace <impl fmt::Display for ParseError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- src/io/reader/record_buf.rs
+++ replace <impl fmt::Display for ParseError>::fmt -> fmt::Result with Ok(Default::default())
@@ -57,26 +57,17 @@
             Self::InvalidInfo(e) => Some(e),
             Self::InvalidSamples(e) => Some(e),
         }
     }
 }
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::InvalidPosition(_) => write!(f, "invalid position"),
-            Self::InvalidIds(_) => write!(f, "invalid IDs"),
-            Self::InvalidReferenceBases(_) => write!(f, "invalid reference bases"),
-            Self::InvalidAlternateBases(_) => write!(f, "invalid alternate bases"),
-            Self::InvalidQualityScore(_) => write!(f, "invalid quality score"),
-            Self::InvalidFilters(_) => write!(f, "invalid filters"),
-            Self::InvalidInfo(_) => write!(f, "invalid info"),
-            Self::InvalidSamples(_) => write!(f, "invalid samples"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) fn parse_record_buf(
     mut s: &str,
     header: &Header,
     record: &mut RecordBuf,
 ) -> Result<(), ParseError> {

*** result: Success
