*** src/io/reader/record_buf/info.rs:21:9: replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None

*** mutation diff:
--- src/io/reader/record_buf/info.rs
+++ replace <impl error::Error for ParseError>::source -> Option<&(dyn error::Error +'static)> with None
@@ -13,20 +13,17 @@
     /// A field is invalid.
     InvalidField(field::ParseError),
     /// A key is duplicated.
     DuplicateKey(String),
 }
 
 impl error::Error for ParseError {
     fn source(&self) -> Option<&(dyn error::Error + 'static)> {
-        match self {
-            Self::InvalidField(e) => Some(e),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for ParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         match self {
             ParseError::Empty => write!(f, "empty input"),
             ParseError::InvalidField(e) => {

*** result: Success
