*** src/io/reader/record_buf/position.rs:35:13: delete match arm num::IntErrorKind::Empty in <impl From<num::ParseIntError> for ParseError>::from

*** mutation diff:
--- src/io/reader/record_buf/position.rs
+++ delete match arm num::IntErrorKind::Empty in <impl From<num::ParseIntError> for ParseError>::from
@@ -27,17 +27,17 @@
             Self::Invalid(_) => write!(f, "invalid input"),
         }
     }
 }
 
 impl From<num::ParseIntError> for ParseError {
     fn from(e: num::ParseIntError) -> Self {
         match e.kind() {
-            num::IntErrorKind::Empty => Self::Empty,
+             /* ~ changed by cargo-mutants ~ */
             _ => Self::Invalid(e),
         }
     }
 }
 
 pub(super) fn parse_position(s: &str) -> Result<Option<Position>, ParseError> {
     const TELOMERE_START: &str = "0";

*** result: Success
