*** src/record.rs:51:9: replace Record::reference_bases -> &str with "xyzzy"

*** mutation diff:
--- src/record.rs
+++ replace Record::reference_bases -> &str with "xyzzy"
@@ -43,17 +43,17 @@
 
     /// Returns the IDs.
     pub fn ids(&self) -> Ids<'_> {
         self.0.ids()
     }
 
     /// Returns the reference bases.
     pub fn reference_bases(&self) -> &str {
-        self.0.reference_bases()
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Returns the alternate bases.
     pub fn alternate_bases(&self) -> AlternateBases<'_> {
         self.0.alternate_bases()
     }
 
     /// Returns the quality score.

*** result: Success
