*** src/record/info.rs:87:9: replace <impl crate::variant::record::Info for Info<'_>>::get -> Option<io::Result<Option<Value<'a>>>> with None

*** mutation diff:
--- src/record/info.rs
+++ replace <impl crate::variant::record::Info for Info<'_>>::get -> Option<io::Result<Option<Value<'a>>>> with None
@@ -79,17 +79,17 @@
         }
     }
 
     fn get<'a, 'h: 'a>(
         &'a self,
         header: &'h Header,
         key: &str,
     ) -> Option<io::Result<Option<Value<'a>>>> {
-        self.get(header, key)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn iter<'a, 'h: 'a>(
         &'a self,
         header: &'h Header,
     ) -> Box<dyn Iterator<Item = io::Result<(&'a str, Option<Value<'a>>)>> + 'a> {
         Box::new(self.iter(header))
     }

*** result: Success
