*** src/record/samples/series/value/genotype.rs:67:35: replace + with - in next_allele

*** mutation diff:
--- src/record/samples/series/value/genotype.rs
+++ replace + with - in next_allele
@@ -59,17 +59,17 @@
     let phasing = parse_phasing(&buf[..1])?;
     let position = parse_position(&buf[1..])?;
 
     Ok((position, phasing))
 }
 
 fn next_allele<'a>(src: &mut &'a str) -> &'a str {
     let (buf, rest) = match src.chars().skip(1).position(is_phasing_indicator) {
-        Some(i) => src.split_at(i + 1),
+        Some(i) => src.split_at(i - /* ~ changed by cargo-mutants ~ */ 1),
         None => src.split_at(src.len()),
     };
 
     *src = rest;
 
     buf
 }

*** result: Success
